{
  "lesson1": {
    "topic": "me / you / my / your",
    "options": ["me", "you", "my", "your"],
    "help": "This lesson helps you talk about yourself and others in everyday situations. Use “me” when talking about yourself as the object (“Give it to me”), and “you” when talking to someone else. “My” shows something belongs to you (“my phone”), and “your” shows something belongs to the person you're talking to (“your keys”). Try using these in real life: “This is my bag. Is that your jacket?” Practice pointing to things and saying whose they are—it’s a great way to build confidence with basic conversation.,",
    "examples": [
      "She said to me: 'I like _______ because you're always kind to me.'|you",
      "She pointed to her book and said, 'This is _______ book, not yours.'|my",
      "Can you help _______ carry these bags up the stairs?|me",
      "Is that _______ phone ringing in your bag right now?|your",
      "She gave _______ a gift after the meeting to thank me for my help.|me",
      "I see _______ every morning at the bus stop near the bakery.|you",
      "You must have been walking in the mud — _______ shoes are completely covered.|your",
      "_______ name is Peter, and I’m a foreigner from Germany.|my",
      "Please call _______ when you arrive home so I know you're safe.|me",
      "I want to talk to _______ about your project before the deadline.|you"
    ]
  },
  "lesson2": {
    "topic": "he / she / his / her",
    "options": ["he", "she", "his", "her"],
    "help": "In this lesson, you’ll learn how to talk about other people and things. Use “he” for a man or boy, “she” for a woman or girl, and “it” for objects or animals (unless the animal has a name, then use “he” or “she”). For example: “He is my brother,” “She is a teacher,” “It is a cat.” Try describing people around you or things in your room. This helps you build sentences and describe the world clearly. Don’t worry if you mix them up—just keep practicing!",
    "examples": [
      "_______ is my brother and he plays guitar.|he",
      "_______ is my sister and she loves painting.|she",
      "This is _______ notebook from class, not mine.|his",
      "That is _______ phone on the desk, next to her bag.|her",
      "Johnny has a big dog. _______ dog barks loudly at strangers.|his",
      "I met a girl named Emily. _______ name is Emily and she’s from Spain.|her",
      "Dr. Smith is a dentist. _______ is a dentist who works nearby.|he",
      "My neighbor owns a red car. _______ car is parked in front of the house.|his",
      "My friend Anna lives nearby. _______ house has a red roof and a garden.|her",
      "Uncle Tom lives in Berlin. _______ is my uncle who lives there.|he"
    ]
  },
  "lesson3": {
    "topic": "go / went / will go / is going",
    "options": ["go", "went", "will go", "is going"],
    "help": "This lesson teaches you how to talk about groups. Use “we” when you include yourself (“We are friends”) and “they” when you talk about others (“They are at school”). “Our” shows something belongs to your group (“our house”), and “their” shows something belongs to another group (“their car”). Try talking about your family, friends, or classmates using these words. For example: “We love our dog,” or “They forgot their books.” These words are great for teamwork, storytelling, and everyday conversations.",
    "examples": [
      "Every weekday, I _______ to school by bike.|go",
      "Yesterday, she _______ to the market for fruit.|went",
      "Tomorrow, we _______ to the zoo with our class.|will go",
      "Right now, he _______ to the gym for his workout.|is going",
      "Last weekend, they _______ to the beach for a picnic.|went",
      "On Mondays, I _______ to work by train.|go",
      "Every Friday, we _______ to the cinema after dinner.|go",
      "Later today, I _______ to the store for groceries.|will go",
      "At the moment, she _______ to the library to study.|is going",
      "Last summer, they _______ to the mountains for hiking.|went"
    ]
  },
  "lesson4": {
    "topic": "is / are / was / were",
    "options": ["is", "are", "was", "were"],
    "help": "This lesson focuses on the verb “to be,” which is used all the time in English. Use “I am” for yourself, “you are” for the person you're talking to, “he/she/it is” for others, and “we/they are” for groups. For example: “I am happy,” “She is tired,” “They are ready.” These forms help you describe feelings, locations, and facts. Try making short sentences about yourself and others. This is one of the most useful tools for speaking clearly and confidently in English.",
    "examples": [
      "The dog _______ hungry right now.|is",
      "They _______ at the park yesterday afternoon.|were",
      "My friends _______ always very kind and helpful.|are",
      "She _______ a teacher before she retired.|was",
      "We _______ excited about the trip tomorrow.|are",
      "He _______ at home when I called.|was",
      "The books _______ on the shelf last week.|were",
      "This sandwich _______ delicious at the moment.|is",
      "You _______ very tired after the long hike yesterday.|were",
      "The children _______ playing outside right now.|are"
    ]
  },
  "lesson5": {
    "topic": "Do / Does / Did / Are",
    "options": ["Do", "Does", "Did", "Are"],
    "help": "Here you’ll learn how to point to things and describe where they are. Use “this” for one thing near you (“This is my pen”) and “that” for one thing far away (“That is your bag”). “These” is for multiple things near you, and “those” is for multiple things far away. Try pointing to objects around you and saying “this” or “that.” It’s a great way to practice describing your environment. These words are super helpful when shopping, giving directions, or showing things to others.",
    "examples": [
      "_______ you like pizza?|Do",
      "_______ she live near here with her parents?|Does",
      "_______ we going to the park today after lunch?|Are",
      "_______ you see that movie last weekend at the cinema?|Did",
      "_______ your friends coming over later for the game night?|Are",
      "_______ he play guitar well in his band?|Does",
      "_______ you remember her name from the meeting yesterday?|Do",
      "_______ she call you yesterday after the presentation?|Did",
      "_______ they usually take the bus to school?|Do",
      "_______ your brother enjoy playing chess with you?|Does"
    ]
  },
  "lesson6": {
    "topic": "me / you / my / your",
    "options": ["me", "you", "my", "your"],
    "help": "This lesson helps you express what someone is able or allowed to do. Use “can” to say someone is able to do something (“I can swim”) and “can’t” to say they are not (“She can’t drive”). You can also use “can” to ask for permission: “Can I go?” Practice by talking about your skills or asking friends what they can do. Try saying things like “I can cook,” or “Can you help me?” These words are essential for polite requests and everyday communication.",
    "examples": [
      "_______ dog loves chasing squirrels in your backyard every afternoon.|your",
      "_______ house has a blue door and white walls with ivy growing on the side.|my",
      "He told _______ a joke during lunch that made me laugh out loud.|me",
      "I will meet _______ at the library at 3 PM to study together.|you",
      "I heard that _______ brother plays guitar in a band that performs on weekends.|your",
      "_______ sister is studying medicine at university and wants to become a surgeon.|my",
      "Can you show _______ how to use this app before the meeting starts?|me",
      "I made this for _______ to say thank you for your help yesterday.|you",
      "I think _______ car is parked outside the school next to the red one.|your",
      "_______ favorite subject is history, especially ancient civilizations and wars.|my"
    ]
  },
  "lesson7": {
    "topic": "he / she / his / her",
    "options": ["he", "she", "his", "her"],
    "help": "This lesson teaches you how to ask questions and make negative sentences in the present tense. Use “do” with I/you/we/they and “does” with he/she/it. For example: “Do you like pizza?” or “Does she play tennis?” Use “don’t” and “doesn’t” to say no: “I don’t know,” “He doesn’t work here.” Practice by asking and answering simple questions about daily life. These words are key for conversations, interviews, and expressing opinions. The more you use them, the more natural they’ll feel.",
    "examples": [
      "Aunt Lisa teaches science. _______ is my aunt who teaches it.|she",
      "After the show, I gave the flowers to my aunt. I gave the flowers to _______ as a thank-you.|her",
      "I saw my uncle at the library yesterday. _______ was reading a newspaper near the window.|he",
      "Tom left his pencil on the desk. _______ pencil is still there next to the notebook.|his",
      "Anna’s backpack is purple. _______ backpack has stars on it and a keychain.|her",
      "My cousin plays basketball. _______ is very tall and athletic, just like his dad.|he",
      "My sister volunteers often. _______ is very kind and helpful at the shelter.|she",
      "My uncle goes to the café often. _______ likes to sit by the window and read.|he",
      "I call my aunt every weekend. I talk to _______ on Sundays about her garden.|her",
      "That is _______ phone on the desk, next to her bag.|her"
    ]
  }
}
